# Exploratory Data Analysis

## SQL

In [1]:
import pandas as pd

%load_ext sql

Establish a connection to the data base before you run the following cell:
Create a text file called **.env** containing

> PGSQL_USER=USERNAME  \
> PGSQL_PASSWORD= PASSWORD 

**Note:** I (Cannur) created .env file with my credentials so you do not need to create it. You can run it directly.

In [2]:
from dotenv import load_dotenv
import os

load_dotenv()
username = os.getenv('PGSQL_USER')
password = os.getenv('PGSQL_PASSWORD')
hostname = 'gip.itc.utwente.nl'
portname = '5434'
databasename = 'c211'

%sql postgresql://{username}:{password}@{hostname}:{portname}/{databasename}

Now, we can find the database has how many rows.

In [3]:
%sql \
select count(*) as Row_Counts\
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(2530161,)]

Now, we can see the first 3 rows.

In [4]:
%%sql 
Select * from vw_observation2017
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(1755950, '441', '5639', datetime.date(2017, 3, 18), 36552, 227, 618, '15:28', 33989999),
 (1457662, '619', '5639', datetime.date(2017, 4, 1), 43145, 270, 569, '16:23', 33990000),
 (1457664, '70', '5639', datetime.date(2017, 4, 1), 43145, 270, 569, '15:44', 33990004)]

We can see the first 3 rows for the other tables.

In [5]:
%%sql 
Select * from vw_myblock
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(44608, 202, 318, '01030000204071000001000000050000000000000080A8084100000000C06813410000000080A80841000000006078134100000000C0C70841000000006078134100000000C0C7084100000000C06813410000000080A8084100000000C0681341', '870134'),
 (44609, 177, 310, '010300002040710000010000000500000000000000409B054100000000C0EB124100000000409B05410000000060FB12410000000080BA05410000000060FB12410000000080BA054100000000C0EB124100000000409B054100000000C0EB1241', '870135'),
 (44610, 174, 314, '010300002040710000010000000500000000000000803D054100000000402A134100000000803D054100000000E039134100000000C05C054100000000E039134100000000C05C054100000000402A134100000000803D054100000000402A1341', '870136')]

In [6]:
%%sql 
Select * from vw_myblocklanduse
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(60, 'Hoofdweg', 1, 6537.33085031952),
 (60, 'Landbouw', 1, 871977.654549437),
 (60, 'Recreatie', 1, 39618.6174416008)]

In [7]:
%%sql 
Select * from vw_roadlengths
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(2, '0103000020407100000100000005000000000000000088C3400000000080AE1741000000000088C3400000000020BE174100000000007CC5400000000020BE174100000000007CC5400000000080AE1741000000000088C3400000000080AE1741', 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0),
 (3, '0103000020407100000100000005000000000000000088C3400000000020BE1741000000000088C34000000000C0CD174100000000007CC54000000000C0CD174100000000007CC5400000000020BE1741000000000088C3400000000020BE1741', 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0),
 (4, '0103000020407100000100000005000000000000000088C34000000000C0CD1741000000000088C3400000000060DD174100000000007CC5400000000060DD174100000000007CC54000000000C0CD1741000000000088C34000000000C0CD1741', 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0)]

In [8]:
%%sql 
Select * from precipitation
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(48471, 20170322, 52.0525, 5.62822, 0.0, '010100002040710000684FCD9D5FF00441CDD2039862901B41', 23313),
 (48471, 20170323, 52.0525, 5.62822, 0.0, '010100002040710000684FCD9D5FF00441CDD2039862901B41', 23313),
 (48471, 20170324, 52.0525, 5.62822, 0.0, '010100002040710000684FCD9D5FF00441CDD2039862901B41', 23313)]

In [9]:
%%sql 
Select * from temperature
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(21944, 20170424, 51.2509, 3.80463, 15.0413, '0101000020407100009634E9AF99BCE540883057F634311641', 1439),
 (21944, 20170425, 51.2509, 3.80463, 10.3514, '0101000020407100009634E9AF99BCE540883057F634311641', 1439),
 (21944, 20170614, 51.2509, 3.80463, 26.1349, '0101000020407100009634E9AF99BCE540883057F634311641', 1439)]

In [10]:
%%sql 
Select * from block_demography
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(167, 18, 375, '0103000020407100000100000005000000000000000094D1400000000060E31641000000000094D1400000000000F3164100000000008ED2400000000000F3164100000000008ED2400000000060E31641000000000094D1400000000060E31641', 5, 115, 1005, 1755, 4275, 8715, 9390, 9565),
 (168, 18, 376, '0103000020407100000100000005000000000000000094D1400000000000F31641000000000094D14000000000A002174100000000008ED24000000000A002174100000000008ED2400000000000F31641000000000094D1400000000000F31641', 10, 450, 1070, 1725, 3885, 6915, 9220, 9525),
 (169, 18, 377, '0103000020407100000100000005000000000000000094D14000000000A0021741000000000094D140000000004012174100000000008ED240000000004012174100000000008ED24000000000A0021741000000000094D14000000000A0021741', 0, 475, 625, 1660, 1885, 6515, 7420, 9345)]

In [11]:
%%sql 
Select * from block_road_access
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(60, 'W', 1, 900.48733374501),
 (61, 'W', 1, 1656.38376965095),
 (62, 'G', 1, 656.363163271632)]

In [12]:
%%sql 
Select * from days
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(20170102, datetime.date(2017, 1, 2), 2, 1, False),
 (20170103, datetime.date(2017, 1, 3), 3, 2, False),
 (20170104, datetime.date(2017, 1, 4), 4, 3, False)]

We can find: 
- how many observer, 
- different species and 
- different blocks.

In [13]:
%%sql 
Select count(distinct observer) as Number_of_Observer
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(11805,)]

In [14]:
%%sql 
Select count(distinct species) as Number_of_Species
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(464,)]

In [15]:
%%sql 
Select count(distinct block) as Number_of_block
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(33535,)]

We can check the null cells.

In [16]:
%%sql 
select count(*) 
from vw_observation2017 
where id isnull or 
 species isnull or 
 observer isnull or
 obsdate isnull or 
 block isnull or 
 longit isnull or
 latit isnull or
 obstime isnull or
 idd isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(450421,)]

In [17]:
%%sql 
select count(*) 
from vw_observation2017 
where obstime isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(450421,)]

## DASK

We can explore the data with **DASK**.

In [1]:
import dask.dataframe as dd

In [2]:
df_observation2017 = dd.read_sql_table('vw_observation2017', 'postgresql://s2495929:_s2495929_@gip.itc.utwente.nl:5434/c211', index_col='id')
df_observation2017.head()

        species observer     obsdate  block  longit  latit obstime       idd
id
2332720     167    25099  2017-03-19  25336     179    442   09:00  34234783
2173617     695    25099  2017-03-12  28140     190    429   09:00  34234784
2332719     111    25099  2017-03-19  25336     179    442   09:00  34234785
3945377     614    25099  2017-05-23   2088      52    423   09:30  34234786
3983516     594    25099  2017-05-23   1699      47    411   07:30  34234788

In [3]:
df_days = dd.read_sql_table('days', 'postgresql://s2495929:_s2495929_@gip.itc.utwente.nl:5434/c211', index_col='mdate')
df_days=df_days.reset_index(drop=False)
df_days.head()

      mdate       odate  doy  dow  natholiday
0  20170102  2017-01-02    2    1       False
1  20170103  2017-01-03    3    2       False
2  20170104  2017-01-04    4    3       False
3  20170105  2017-01-05    5    4       False
4  20170106  2017-01-06    6    5       False

Merge 2 dataframes (observation2017 and days) using left join function

In [15]:
merged_1 = dd.merge(left=df_observation2017, right=df_days, how='left', left_on='obsdate', right_on='odate').drop('obsdate', axis=1)
merged_1.head()

,species,observer,block,longit,latit,obstime,idd,mdate,odate,doy,dow,natholiday
0,807,36464,25131,178,492,12:45,34267380,20170115,2017-01-15,15,0,False
1,638,36464,25917,181,513,14:05,34267381,20170311,2017-03-11,70,6,False
2,68,36464,25131,178,492,12:46,34267382,20170115,2017-01-15,15,0,False
3,17,36464,19124,154,486,14:03,34267383,20170212,2017-02-12,43,0,False
4,302,36464,25131,178,492,11:21,34267384,20170108,2017-01-08,8,0,False

Merge 2 dataframes (merged_1 and precipitation) using left join function

In [5]:
df_precipitation = dd.read_sql_table('precipitation', 'postgresql://s2495929:_s2495929_@gip.itc.utwente.nl:5434/c211', index_col='id')
df_precipitation.head()

/usr/local/lib/python3.8/dist-packages/dask/dataframe/io/sql.py:113: SAWarning: Did not recognize type 'geometry' of column 'corner'
  table = sa.Table(table, m, autoload=True, autoload_with=engine, schema=schema)

,dtime,lat,lon,precip,corner,block
id,,,,,,
22840,20170101,51.2771,3.74639,4.695590,010100002040710000121094F388C8E34097490E2B1760...,1184
22840,20170103,51.2771,3.74639,1.071720,010100002040710000121094F388C8E34097490E2B1760...,1184
22840,20170105,51.2771,3.74639,0.000000,010100002040710000121094F388C8E34097490E2B1760...,1184
22840,20170107,51.2771,3.74639,0.882307,010100002040710000121094F388C8E34097490E2B1760...,1184
22840,20170109,51.2771,3.74639,7.195980,010100002040710000121094F388C8E34097490E2B1760...,1184

In [16]:
merged_2 = dd.merge(left=merged_1, right=df_precipitation[['dtime', 'precip', 'block']], how='left', left_on= ['mdate', 'block'], right_on=['dtime', 'block'])
merged_2.head()

,species,observer,block,longit,latit,obstime,idd,mdate,odate,doy,dow,natholiday,dtime,precip
0,92,17616,44665,211,432,18:09,34276151,20170430,2017-04-30,120,0,False,NaN,NaN
1,165,29931,50326,62,362,15:09,34285256,20170428,2017-04-28,118,5,False,NaN,NaN
2,622,29931,50297,41,365,15:39,34285567,20170506,2017-05-06,126,6,False,NaN,NaN
3,622,29931,50297,41,365,15:25,34287030,20170506,2017-05-06,126,6,False,NaN,NaN
4,51,29931,50317,54,359,11:38,34287233,20170428,2017-04-28,118,5,False,NaN,NaN

Merge 2 dataframes (merged_2 and temperature) using left join function

In [21]:
df_temperature = dd.read_sql_table('temperature', 'postgresql://s2495929:_s2495929_@gip.itc.utwente.nl:5434/c211', index_col='id')
df_temperature.head()

,dtime,lat,lon,temper,corner,block
id,,,,,,
21944,20170424,51.2509,3.80463,15.0413,0101000020407100009634E9AF99BCE540883057F63431...,1439
21944,20170425,51.2509,3.80463,10.3514,0101000020407100009634E9AF99BCE540883057F63431...,1439
21944,20170614,51.2509,3.80463,26.1349,0101000020407100009634E9AF99BCE540883057F63431...,1439
21944,20170616,51.2509,3.80463,20.9679,0101000020407100009634E9AF99BCE540883057F63431...,1439
21944,20170617,51.2509,3.80463,25.3648,0101000020407100009634E9AF99BCE540883057F63431...,1439

In [ ]:
merged_3 = dd.merge(left=merged_2, right=df_temperature[['dtime', 'temper', 'block']], how='left', left_on= ['mdate', 'block'], right_on=['dtime', 'block'])
merged_3.tail()

Merge 2 dataframes (merged_3 and demography) using left join function

In [ ]:
df_demography = dd.read_sql_table('block_demography', 'postgresql://s2495929:_s2495929_@gip.itc.utwente.nl:5434/c211', index_col='block')
df_demography.head()

In [ ]:
merged_4 = dd.merge(left=merged_3, right=df_demography[['block', 'pop001', 'pop009', 'pop025', 'pop049', 'pop081', 'pop121', 'pop169', 'pop225']], how='left', left_on= 'block', right_on='block')
merged_4.head()

In [ ]:
df_observation2017.head()

In [ ]:
%time df_observation2017.block.max().compute()

In [ ]:
#x = df.describe()
#x.visualize(filename='observation2017.svg')

In [9]:
(len(df_observation2017), df_observation2017.shape[1])

(2530161, 8)

In [14]:
(len(merged_4), merged_4.shape[1])

(2530161, 14)

In [ ]:
list(df_observation2017.columns)

In [ ]:
df_observation2017.dtypes